app/views/authors/index.html.erb

SELECT "authors".* FROM "authors"
---
    <ul>
      <% Author.all.each do |a| %>