app/views/authors/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 4]]
---
      <ul>
        <% @author.posts.each do |p| %>