app/views/welcome/new.html.erb

    <%= f.label :author_id, class: "col-xs-2 col-xs-offset-1" %>
    <%= collection_select(:post, :author_id, Author.all, :id, :name, prompt: true) %>
---
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts"