app/controllers/authors_controller.rb

  def index
    @other_posts = Post.all
---
SELECT "posts".* FROM "posts"

  def show
    @other_posts = Post.all
    @author = Author.find(params['id'])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 4]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]

  def new
    @other_posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @other_posts = Post.all
    if @author = Author.create(post_params)
---
INSERT INTO "authors" ("name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @other_posts = Post.all
    @author = Author.find(params['id'])
    if @author.update(post_params)
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "authors" SET "bio" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["bio", "This is a blurb about Matthew Fair.  He is pretty great."], ["updated_at", "2015-11-05 02:45:53.944838"], ["id", 6]]

  def edit
    @author = Author.find(params['id'])
    @other_posts = Post.all - [@post]
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 6]]
SELECT "posts".* FROM "posts"