app/controllers/search_controller.rb

  def find
    @results = []
    @terms = params[:q].split
    @terms.each do |t|
      Post.all.each do |p|
---
SELECT "posts".* FROM "posts"

  def search
    @other_posts = Post.all
---
SELECT "posts".* FROM "posts"