app/controllers/show_controller.rb

  def about
    @other_posts = Post.all
---
SELECT "posts".* FROM "posts"