app/controllers/welcome_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts"
---
  def posts
    @post_info = Post.find(params['id'].to_i)
    @other_posts = Post.all - [@post_info]