app/controllers/welcome_controller.rb

  def index
    first_post = Post.all.max{|p| p.created_at.to_f}.id
    @post = Post.find(first_post)
---
SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 6]]

  def show
    @post = Post.find(params['id'].to_i)
    @other_posts = Post.all - [@post]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
SELECT "posts".* FROM "posts"

  def new
    @other_posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create

    @post = Post.new(post_params)
    @post.author_id = 6
    if @post.save
      @other_posts = Post.all
---
INSERT INTO "posts" ("title", "body", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test 3"], ["body", "I think this one might actually work!\r\n"], ["author_id", 6], ["created_at", "2015-11-04 19:26:58.904565"], ["updated_at", "2015-11-04 19:26:58.904565"]]
SELECT "posts".* FROM "posts"

  def update
    @post = Post.find(params['id'])
    if @post.update(post_params)
      redirect_to @post
    else
      @other_posts = Post.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "This is the song that never ends.  Yes it goes on and on my friend.\r\n\r\n"], ["updated_at", "2015-11-04 19:50:48.002902"], ["id", 11]]
SELECT "posts".* FROM "posts"

  def edit
    @post = Post.find(params['id'])
    @other_posts = Post.all - [@post]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts"

  def destroy
    @post = Post.find(params['id'])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 12]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 12]]